blog/2024/03/blog_2024-03-11__08:04:19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-12 Sun 10:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Agilt arbete, en gång till.</title>
<meta name="author" content="Johan Sandén" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../../css/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Agilt arbete, en gång till.
<br />
<span class="subtitle"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-03-11 Mon 08:04&gt;</span></span></span>
</h1>
<div class="org-center">
<p>
<a href="../../blog.html">Blog index</a> |  <a href="../../../index.html">Hemsida</a>
</p>
</div>
<hr />

<p>
Intressegruppen för agila metoder har funnits i minst 9 år hos min
uppdragsgivare. Agila metoder är enkla att förstå och använda. Man kan lära sig
precis allt om en viss metod på någon timme och efter några dagar är det rutin.
</p>

<p>
Nu har det kommit en inbjudan och ämnet är:
</p>
<blockquote>
<p>
Vad kan gå rätt och vad kan gå snett? Kan alla jobba agilt? Vill alla?. Vad
menar vi med agilt arbete? Strukturerna i organisationen i förhållande till de
agila värderingarna och principerna? Utveckla våra arbetssätt rent generellt
inom organisationen? &#x2026; många frågor till kan säkert komma upp.
</p>
</blockquote>

<p>
Det finns mycket fel här att jag inte vet var jag ska börja. Att fylla ett rum
med 20+ personer och planlöst blabba är inte agilt och dessutom borde vi väl
efter 9 år vara överens om vad agilt betyder?
</p>

<p>
Av någon anledning glider tankarna iväg och jag kom att tänka på när Kjell Olof
Feldt satt i riksdagen och skrev en dikt:
<br />
</p>
<p class="verse">
Löntagarfonder är ett jävla skit,<br />
men nu har vi baxat dem ända hit.<br />
Sen ska de fyllas med varenda pamp,<br />
som stött oss så starkt i våran kamp.<br />
Nu behöver vi inte gå flera ronder,<br />
förrän hela Sverige är fullt av fonder.<br />
</p>
<p>
<br />
Så jag gör en egen:
<br />
</p>
<p class="verse">
Agilt ältande är ett jävla skit<br />
nu har vi baxat det ända hit<br />
Sen ska de fyllas upp med varenda pamp<br />
som stött oss utvecklare i vår kamp<br />
Kanske ska man dessa möten nobba<br />
bara köra agilt och jobba<br />
</p>
<p>
<br />
<br />
Min gissning är att någon fått gå grundkursen i scrum och sen fick "fealing".
</p>

<p>
<br />
</p>

<p>
Jag gissar också att det här är ännu ett sätt att försöka visa för en ledning
eller chef att man gör vad man kan för att sänka kostnader eller dylikt. Att det
är bisart kontraproduktivt spelar ingen roll.
</p>
<hr />
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-03-11 Mon 08:04</p>
<p class="author">Author: Johan Sandén</p>
<p class="date">Created: 2024-05-12 Sun 10:09</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.4.6)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
